[net]
batch=1
channels=6
height=32
width=32

[convolutional]
filters=128
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=182
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=182
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=182
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=182
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=182
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=182
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=182
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=182
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=430
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=430
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=455
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=600
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[maxpool]
size=8
stride=1

[connected]
output=2
activation=linear

[softmax]
groups=1

