[net]
batch=1
channels=3
height=32
width=32

[convolutional]
filters=32
size=5
stride=1
pad=1
activation=linear

[maxpool]
size=3
stride=2

[ReLU]

[convolutional]
filters=32
size=5
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=64
size=5
stride=1
pad=1
activation=relu

[avgpool]

[connected]
output=64
activation=linear

[connected]
output=10
activation=linear

[softmax]
groups=1

